# 设置所有 word 格式
# 1. 该程序只能处理 docx 文档
from docx.enum.text import WD_PARAGRAPH_ALIGNMENT


WORD_SETTING = {
    # 1. 设置正文格式
    "英文字体": "Times New Roman",
    "中文字体": "宋体",
    "正文字号": 10,            # 磅
    "正文加粗": False,         # 默认不加粗
    "正文对齐": -1,            # -1 左对齐; 0 居中对齐; 1 右对齐

    # 2. 设置表格样式(参考: https://blog.csdn.net/xtfge0915/article/details/83480120)
    "表格样式": "Medium Grid 1 Accent 5",

    # 3. 设置图片
    "图片对齐": 0,
    "图片宽度": 14,  # 厘米
    "图片高度": 7  # 厘米
}

# 标题级别
HEADING_NUMBER = {
    "一级标题": 1,
    "二级标题": 2,
    "三级标题": 3,
    "四级标题": 4,
    "五级标题": 5,
    "六级标题": 6,
    "七级标题": 7,
}

# 段落对齐映射
ALIGNMENT_DICT = {
    -1: WD_PARAGRAPH_ALIGNMENT.LEFT,
    0: WD_PARAGRAPH_ALIGNMENT.CENTER,
    1: WD_PARAGRAPH_ALIGNMENT.RIGHT
}


TEXT = {
    "head_1": "第一章 不同归因方法下的多变量预测模型对比",
    "head_1.1": "1.1 流程描述",
    "head_1.1.1": "1.1.1 因子筛选流程",
    "para_1.1.1": "(1) 准备原始数据: 宏观因子数据, 商品指数数据, 经济不确定指标\n"
                  "(2) 挑选出前70%的数据做处理\n"
                  "(3) 数据标准化处理\n"
                  "(4) ADF检验\n"
                  "(5) T检验, anova检验\n"
                  "(6) 分别用逐步回归, lasso和贪心算法挑选出线性关系显著的因子\n"
                  "(7) VIF检验(共线性排查)\n"
                  "(8) 将筛选出的因子和标签保存到本地进行预测",
    "head_1.1.2": "1.1.2 模型预测流程",
    "para_1.1.2": "(1) 挑选出前70%的数据作为训练集(训练集: 172, 测试集: 74)\n"
                  "(2) 构建模型(VectorAr, ExtraTrees, RandomForest, LGBM)\n"
                  "(3) 设置重新训练间隔5d, 滑动窗口 150d, 预测未来期数 1d(即, 每5天重新训练一次模型,每次使用150条数据训练,每次预测未来1期数据)\n"
                  "(4) 获取预测结果并保存到本地\n"
                  "(5) 结果可视化展示\n"
                  "(6) 将四个模型的结果组合形成新的模型并输出预测结果",
    "head_1.2": "1.2 因子筛选结果汇总",
    "head_1.3": "1.3 模型预测结果汇总",
    "head_1.4": "1.4 模型预测结果展示",

}
